[
    {
        "title": "Replay – Red Faction",
        "author": "Andrew Reiner",
        "date": " on Jan 08, 2016 at 02:00 PM",
        "content": [
            "On this week's Game Informer Show we reflected on games that are difficult to go back to on PlayStation 2. The discussion eventually landed on first-person shooters and how this genre was still feeling its way through uncharted territory. With that topic fresh on our minds we decided to jump into Red Faction, a PlayStation 2 classic developed by Volition Software.",
            "Red Faction's premise of a mining expedition on Mars ending in disaster is as rote as science fiction gets, but the gameplay offered a wrinkle we hadn't seen at the time. Using a technology called \"Geometry Modifiction\" or \"Geo-Mod,\" the player can use explosives to destroy and tunnel through the terrain. If a door won't open, simply blow out the wall next to it. Game Informer's Tim Turi expertly shows off this powerful technology in this week's episode. He's joined by Andrew Reiner, Jeff Cork, and Ben Hanson. We also veer off of the single-player campaign to check out Red Faction's two-player multiplayer, which is still surprisingly great.",
            "Our second segment takes us to Japan for a look at a peculiar mash-up of worlds. Thanks again for the support, everyone! We'll be back in seven short days! If you can't wait that long, check out our Beyond Good & Evil and Martian Gothic Super Replays."
        ]
    },
    {
        "title": "Replay – The Legend Of Zelda: Twilight Princess",
        "author": "Andrew Reiner",
        "date": " on Jan 13, 2017 at 02:00 PM",
        "content": [
            "The Nintendo Switch launches on March 3 with The Legend of Zelda: Breath of the Wild available on day one. This isn't the first time that a new Zelda adventure has been available at launch, and it isn't the first time that the game will be available on two different systems. Nintendo is repeating the same strategy for The Legend of Zelda: Twilight Princess, which launched on Wii and GameCube in 2006. Yes, 10 years have already passed since its release. ",
            "On this episode of Replay, we take a look back at Twilight Princess's opening moments, and discuss the Zelda series at large as Brian Shea struggles to win the affection of a cat. We also talk about the Zelda game we would like to see, and speculate about the Switch, a segment we knew would bring extensive mocking on your behalf.",
            "The second game we look at is a party game that we anticipated to be terrible, but ended up having a blast with. Enjoy the show, everyone. We'll see you again in seven short days."
        ]
    },
    {
        "title": "Replay – Aliens: Colonial Marines",
        "author": "Andrew Reiner",
        "date": " on Aug 29, 2019 at 05:00 PM",
        "content": [
            "Join the Game Informer crew for a look at one of the most controversial games of all time. We're playing through the opening acts of Gearbox Software and Sega's Aliens: Colonial Marines, a game that looked great in trailers prior to release, yet ended up looking considerably different when players finally got their hands on it. We discuss this topic, and also try to find the good in this 2013 release as we try to keep the xenomorph scourge at bay.",
            "Make sure to subscribe on Twitch and YouTube to be notified when we go live next, like we do with Replay every Friday at 2 PM Central. Thanks again for the support, everyone!"
        ]
    },
    {
        "title": "Replay – Orphen: Scion Of Sorcery",
        "author": "Tim Turi",
        "date": " on Mar 08, 2014 at 02:00 AM",
        "content": [
            "The Game Informer video game vault is a vast, wonderful landscape of discs and cartridges spanning all generations of consoles. Sometimes we walk in there and peruse the shelves, waiting for something to pop out at us so we can share it with you on Replay. This week it was Artoon's anime-infused RPG, Orphen: Scion of Sorcery. The 2000 PlayStation 2 title blends together a unique real-time combat system, animated cutscenes, and goofy in-game story sequences.",
            "All aboard as Jeff Cork, Andrew Reiner, and I dive into the corny dialogue and ridiculous environments Orphen has to offer. "
        ]
    },
    {
        "title": "Replay – Legacy Of Kain: Soul Reaver",
        "author": "Tim Turi",
        "date": " on Aug 27, 2011 at 04:00 AM",
        "content": [
            "When most people think of Crystal Dynamics, they probably think about Tomb Raider. Others may remember a series called the Legacy of Kain, which featured an offshoot featuring a soul-sucking vampire named Raziel.",
            "Ben Reeves, Andrew Reiner, Jeff Cork, and I revisit this forgotten gem in this week's episode of Replay. Enjoy Ben's trademark madness as we impale, immolate, drown, and generally mess up some undead enemies. Also, stick around for a Roulette that survived the test of time surprisingly well."
        ]
    },
    {
        "title": "Replay – Project Snowblind",
        "author": "Suriel Vazquez",
        "date": " on Dec 07, 2018 at 08:00 PM",
        "content": [
            "While most modern players will recognize them as the Tomb Raider studio of record (their recent foray away from the series in favor of an Avengers game notwithstanding), Crystal Dynamics has a long history of games without any tombs or raiding. Case in point: 2005's Project Snowblind, a game many people remember for having existed. It released in what now seems like a strange era for shooters; far removed from the more high-octane romps of the 90s, but not quite in time to be part of the ADS trend that took the genre by storm a few years after. Anyway, Reiner, Leo, and I run this shooter through its cyber paces, and tackle a more classic game right after."
        ]
    }
]